cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'diff-so-fancy'
brew 'ffmpeg'
brew 'git'
brew 'go'
brew 'grc'
brew 'htop-osx'
brew 'shellcheck'
brew 'terminal-notifier'
brew 'the_silver_searcher'
# brew 'unrar'
# brew 'vim', args: ['--override-system-vi']
brew 'wget'
brew 'zsh'
brew 'yarn'
brew 'awscli'
brew 'rbenv'
brew 'bat'
brew 'lolcat'
brew 'jq'
brew 'imagemagick'
brew 'archey'
brew 'neofetch'

# gnu stuff
brew 'coreutils'
brew 'findutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'gawk'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-getopt'

# antibody
tap 'getantibody/homebrew-antibody'
brew 'antibody'

# casks
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

cask 'diffmerge'
cask 'docker'
cask 'font-hack'
cask 'iterm2'
cask 'hyper'
cask 'kitty'
cask 'visual-studio-code'
cask 'google-chrome'
cask 'firefox'
# cask 'microsoft-edge-canary'
cask 'the-unarchiver'
cask 'appcleaner'
cask 'vlc'
cask 'imageoptim'
cask 'sequel-pro'
cask 'transmission'
cask 'sketch'
# cask 'abstract'
cask 'insomnia'
# cask 'gitup'
cask 'slack'
cask 'alfred'
cask 'gimp'
# cask 'kap'
# cask 'macdown'
cask 'runjs'
# cask 'dash'
cask 'geekbench'

# https://github.com/sindresorhus/quick-look-plugins
# cask 'qlcolorcode'
cask 'qlimagesize'
# cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
# cask 'suspicious-package'
cask 'webpquicklook'
